In [3]:
# Dados
import pandas as pd
import numpy as np
import random as rnd
import statistics

# Visualização
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

# Machine learning
from sklearn.linear_model import LogisticRegression
from sklearn.svm import SVC, LinearSVC
from sklearn.ensemble import RandomForestClassifier
from sklearn.neighbors import KNeighborsClassifier
from sklearn.naive_bayes import GaussianNB
from sklearn.linear_model import Perceptron
from sklearn.linear_model import SGDClassifier
from sklearn.tree import DecisionTreeClassifier


"""
import pandas as pd
import numpy as np
import statistics
import matplotlib.pyplot as plt
"""

'\nimport pandas as pd\nimport numpy as np\nimport statistics\nimport matplotlib.pyplot as plt\n'

In [4]:
df = pd.read_csv('tested.csv')

In [5]:
#Vendo quais colunas tem o dataset
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [6]:
"""
DESCRIÇÃO DAS COLUNAS DO DATASET
PassengerId: Unique identifier for each passenger
Survived: Whether the passenger survived (0 = No, 1 = Yes)
Pclass: Passenger class (1 = 1st class, 2 = 2nd class, 3 = 3rd class)
Name: Passenger's name
Sex: Passenger's gender (male or female)
Age: Passenger's age in years
SibSp: Number of siblings/spouses aboard the Titanic
Parch: Number of parents/children aboard the Titanic
Ticket: Ticket number
Fare: Fare paid for the ticket
Cabin: Cabin number
Embarked: Port of embarkation (C = Cherbourg, Q = Queenstown, S = Southampton)
"""

"\nDESCRIÇÃO DAS COLUNAS DO DATASET\nPassengerId: Unique identifier for each passenger\nSurvived: Whether the passenger survived (0 = No, 1 = Yes)\nPclass: Passenger class (1 = 1st class, 2 = 2nd class, 3 = 3rd class)\nName: Passenger's name\nSex: Passenger's gender (male or female)\nAge: Passenger's age in years\nSibSp: Number of siblings/spouses aboard the Titanic\nParch: Number of parents/children aboard the Titanic\nTicket: Ticket number\nFare: Fare paid for the ticket\nCabin: Cabin number\nEmbarked: Port of embarkation (C = Cherbourg, Q = Queenstown, S = Southampton)\n"

In [7]:
#Saber quantas linhas e colunas tem o dataset
df.shape

(418, 12)

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Survived     418 non-null    int64
 2   Pclass       418 non-null    int64
 3   Name         418 non-null    object
 4   Sex          418 non-null    object
 5   Age          332 non-null    float64
 6   SibSp        418 non-null    int64
 7   Parch        418 non-null    int64
 8   Ticket       418 non-null    object
 9   Fare         417 non-null    float64
 10  Cabin        91 non-null     object
 11  Embarked     418 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 39.3+ KB

In [9]:
#Verificando quais colunas possuem valores nulos
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [10]:
#Substituindo os valores de tickets nulos pela média de valor da classe
df[df['Fare'].isnull()]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
152,1044,0,3,"Storey, Mr. Thomas",male,60.5,0,0,3701,NaN,NaN,S

In [11]:
media_c3= df['Fare'][df['Pclass']==3].mean()
print(media_c3)

12.459677880184334

In [12]:
df['Fare'].fillna(value=media_c3,inplace=True)
df[df['Fare'].isnull()]

Empty DataFrame
Columns: [PassengerId, Survived, Pclass, Name, Sex, Age, SibSp, Parch, Ticket, Fare, Cabin, Embarked]
Index: []

In [13]:
df['Age'] = df['Age'].astype(float)

In [14]:
#Preenchendo as idades de acordo com a média por título do nome
media_age_miss = df[df['Name'].str.contains('Miss.',na=False)]['Age'].mean()
media_age_mrs = df[df["Name"].str.contains('Mrs.', na=False)]['Age'].mean()
media_age_mr = df[df["Name"].str.contains('Mr.', na=False)]['Age'].mean()
media_age_master = df[df["Name"].str.contains('Master.', na=False)]['Age'].mean()

In [33]:
def preenchimento_age(nome_idade):
    name = nome_idade[0]
    age = nome_idade[1]
    if pd.isnull(age):
        if 'Mr.' in name:
            return media_age_mr
        if 'Mrs.' in name:
            return media_age_mrs
        if 'Miss.' in name:
            return media_age_miss
        if 'Master.' in name:
            return media_age_master
        if 'Dr.' in name:
            return media_age_master
        if 'Ms.' in name:
            return media_age_miss
    else:
        return age
df['Age'] = df[['Name', 'Age']].apply(preenchimento_age,axis=1)

print(df['Age'])

0      34.500000
1      47.000000
2      62.000000
3      27.000000
4      22.000000
         ...
413    33.746939
414    39.000000
415    38.500000
416    33.746939
417     7.406471
Name: Age, Length: 418, dtype: float64

In [30]:
#Conferindo se ainda existe alguma idade vazia
df['Age'].isnull().sum()

0

In [34]:
#Excluindo a coluna Cabin porque tem muitos vazios
df.drop(['Cabin'],axis=1, inplace=True)

In [37]:
#Verificando o tipo das colunas
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Embarked        object
dtype: object

In [39]:
df['Pclass'] = df['Pclass'].astype(object)
df['SibSp'] = df['SibSp'].astype(object)
df['Parch'] = df['Parch'].astype(object)
df['Embarked'] = df['Embarked'].astype(object)
df['Survived'] = df['Survived'].astype(object)

In [ ]:
#Separando as variáveis categóricas
df_cat= df['Sex','Embarked','Pclass','SibSp','Parch','Survived']

In [54]:
new_df = pd.concat([df, pd.get_dummies(df['Embarked'],drop_first=True)], axis=1) 

new_df.drop(['Embarked'], axis=1, inplace=True)

In [55]:
df.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,892,NaN,34.5,"Kelly, Mr. James",0,34.5,0,0,330911,7.8292,Q
1,893,NaN,47.0,"Wilkes, Mrs. James (Ellen Needs)",1,47.0,1,0,363272,7.0000,S
2,894,NaN,62.0,"Myles, Mr. Thomas Francis",0,62.0,0,0,240276,9.6875,Q
3,895,NaN,27.0,"Wirz, Mr. Albert",0,27.0,0,0,315154,8.6625,S
4,896,NaN,22.0,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",1,22.0,1,1,3101298,12.2875,S
5,897,NaN,14.0,"Svensson, Mr. Johan Cervin",0,14.0,0,0,7538,9.2250,S
6,898,NaN,30.0,"Connolly, Miss. Kate",1,30.0,0,0,330972,7.6292,Q
7,899,NaN,26.0,"Caldwell, Mr. Albert Francis",0,26.0,1,1,248738,29.0000,S
8,900,NaN,18.0,"Abrahim, Mrs. Joseph (Sophie Halaut Easu)",1,18.0,0,0,2657,7.2292,C
9,901,NaN,21.0,"Davies, Mr. John Samuel",0,21.0,2,0,A/4 48871,24.1500,S

In [56]:
categories = {"female": 1, "male": 0}
df['Sex']= df['Sex'].map(categories)

In [57]:
new_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Q,S
0,892,NaN,34.5,"Kelly, Mr. James",0,34.5,0,0,330911,7.8292,1,0
1,893,NaN,47.0,"Wilkes, Mrs. James (Ellen Needs)",1,47.0,1,0,363272,7.0000,0,1
2,894,NaN,62.0,"Myles, Mr. Thomas Francis",0,62.0,0,0,240276,9.6875,1,0
3,895,NaN,27.0,"Wirz, Mr. Albert",0,27.0,0,0,315154,8.6625,0,1
4,896,NaN,22.0,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",1,22.0,1,1,3101298,12.2875,0,1

In [51]:
df['Embarked'].value_counts()

S    270
C    102
Q     46
Name: Embarked, dtype: int64

In [46]:
#Substituindo as categorias sobreviventes
categories = {"Sobrevivente": 1, "N_sobrevivente": 0}
df['Survived']= df['Survived'].map(categories)

In [47]:
df.h

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,892,NaN,34.5,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,Q
1,893,NaN,47.0,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,S
2,894,NaN,62.0,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,Q
3,895,NaN,27.0,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,S
4,896,NaN,22.0,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,S
5,897,NaN,14.0,"Svensson, Mr. Johan Cervin",male,14.0,0,0,7538,9.2250,S
6,898,NaN,30.0,"Connolly, Miss. Kate",female,30.0,0,0,330972,7.6292,Q
7,899,NaN,26.0,"Caldwell, Mr. Albert Francis",male,26.0,1,1,248738,29.0000,S
8,900,NaN,18.0,"Abrahim, Mrs. Joseph (Sophie Halaut Easu)",female,18.0,0,0,2657,7.2292,C
9,901,NaN,21.0,"Davies, Mr. John Samuel",male,21.0,2,0,A/4 48871,24.1500,S

In [34]:
#Descobrindo a média de preço dos tickets por classe
df.groupby('Pclass')['Fare'].mean()

Pclass
1    94.280297
2    22.202104
3    12.459678
Name: Fare, dtype: float64

In [35]:
#Descobrindo a média de preço total dos tickets
df['Fare'].mean()

35.6271884892086

In [45]:
#Somando quantas mortes tiveram
df[df['Survived']==0]['PassengerId'].count()

266

In [39]:
#Analisando a quantidade de sobreviventes por classe

df[df['Survived']==0].groupby('Pclass')['PassengerId'].count()

Pclass
1     57
2     63
3    146
Name: PassengerId, dtype: int64

In [52]:
# Analisando a quantidade de sobrevientes por sexo e classe
sobreviventes = df[df['Survived']==1]
sobreviventes.groupby(['Sex','Pclass'])['Survived'].sum()

Sex     Pclass
female  1         50
        2         30
        3         72
Name: Survived, dtype: int64

In [58]:
# Gráfico de sobreviventes por sexo
sns.countplot(data=df, x='Sex', hue='Survived')
plt.title('Número de Sobreviventes por Sexo')
plt.xlabel('Sexo')
plt.ylabel('Contagem de Sobreviventes')
plt.show()

ValueError: min() arg is an empty sequence